In [4]:
import pandas as pd

# Example DataFrame
data = {'age': [25, 30, 35, 40],
        'salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

# Get descriptive statistics
df.describe()

             age        salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [5]:
# Basic operations
# df.head(): Displays the first few rows of the DataFrame.
# df.tail(): Displays the last few rows.
# df.shape: Shows the number of rows and columns.
# df.columns: Displays the column names.
# df.describe(): Generates summary statistics for numerical columns.

In [8]:
data = {'age': [25, 30, 35, 40],
        'salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)
df.head()
#df.head(): Displays the first few rows of the DataFrame.

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [9]:
df.tail()

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [11]:
df.shape

(4, 2)

In [15]:
df.columns

Index(['age', 'salary'], dtype='object')

In [16]:
df.describe()

             age        salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [17]:
import pandas as pd
import numpy as np

In [18]:
# Creating a data frame
result = {'name':          ['Alpha','Bravo', 'Charlie','Delta','Echo','Foxtrot','Golf','Hotel','India','Juliet'],
          'roll':          [11,22,33,44,55,66,77,88,99,111],
          'python':        [78,67,89,90,91,72,76,89,67,85],
          'excel':         [89,87,67,74,78,90,76,78,90,54],
           'power_bi':     [45,67,89,87,67,90,65,67,56,90],
          'pandas':        [81,85,89,87,41,45,96,56,93,78],
        'machine_learning':[96,95,84,85,82,81,74,75,96,90],
         'statistics':     [67,48,45,98,75,71,70,60,90,93]}

df = pd.DataFrame(result)
df

,name,roll,python,excel,power_bi,pandas,machine_learning,statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,90,74,87,87,85,98
4,Echo,55,91,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [22]:
df.columns = ['Name','Roll','Python','Excel','Power_bi','Pandas','Machine_learning','Statistics']
df.columns

Index(['Name', 'Roll', 'Python', 'Excel', 'Power_bi', 'Pandas',
       'Machine_learning', 'Statistics'],
      dtype='object')

In [23]:
df

,Name,Roll,Python,Excel,Power_bi,Pandas,Machine_learning,Statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,90,74,87,87,85,98
4,Echo,55,91,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

In [24]:
df.rename(columns={'Roll':'Id', 'Statistics':"Stats"},inplace=True)
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [25]:
# Accessing a column
df['Excel']

0    89
1    87
2    67
3    74
4    78
5    90
6    76
7    78
8    90
9    54
Name: Excel, dtype: int64

In [26]:
df['Power_bi']

0    45
1    67
2    89
3    87
4    67
5    90
6    65
7    67
8    56
9    90
Name: Power_bi, dtype: int64

In [27]:
# Fancy index
df[  ['Excel', 'Stats']  ]

   Excel  Stats
0     89     67
1     87     48
2     67     45
3     74     98
4     78     75
5     90     71
6     76     70
7     78     60
8     90     90
9     54     93

In [28]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [31]:
# slicing 
df.loc[3:8,'Python':'Pandas']

   Python  Excel  Power_bi  Pandas
3      90     74        87      87
4      91     78        67      41
5      72     90        90      45
6      76     76        65      96
7      89     78        67      56
8      67     90        56      93

In [32]:
# slicing 
df.loc[4:8,'Python':'Pandas']

   Python  Excel  Power_bi  Pandas
4      91     78        67      41
5      72     90        90      45
6      76     76        65      96
7      89     78        67      56
8      67     90        56      93

In [33]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

# slicing of dataframe

df.loc[1:2,['Python','Pandas']]

first arg mein colon se pehle row starting row colon ke bad ending row

dosre arg mein column

In [40]:
df.loc[3:8,['Python','Pandas']]

   Python  Pandas
3      90      87
4      91      41
5      72      45
6      76      96
7      89      56
8      67      93

In [41]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [46]:
df.iloc[ 3:8,2:5]

   Python  Excel  Power_bi
3      90     74        87
4      91     78        67
5      72     90        90
6      76     76        65
7      89     78        67

In [47]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [48]:
# fancy indexing
df.iloc[[2,7,9,1],[2,4]]

   Python  Power_bi
2      89        89
7      89        67
9      85        90
1      67        67

In [49]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [50]:
df.iloc[[2,4,8,9],[4,6]]

   Power_bi  Machine_learning
2        89                84
4        67                82
8        56                96
9        90                90

### Deleting a column ,Updating a column, Adding a new column

In [52]:
df

      Name   Id  Python  Excel  Power_bi  Pandas  Machine_learning  Stats
0    Alpha   11      78     89        45      81                96     67
1    Bravo   22      67     87        67      85                95     48
2  Charlie   33      89     67        89      89                84     45
3    Delta   44      90     74        87      87                85     98
4     Echo   55      91     78        67      41                82     75
5  Foxtrot   66      72     90        90      45                81     71
6     Golf   77      76     76        65      96                74     70
7    Hotel   88      89     78        67      56                75     60
8    India   99      67     90        56      93                96     90
9   Juliet  111      85     54        90      78                90     93

In [58]:
df['Extra'] = [1,2,3,4,5,6,7,8,9,10]
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra
0,Alpha,11,78,89,45,81,96,67,1
1,Bravo,22,67,87,67,85,95,48,2
2,Charlie,33,89,67,89,89,84,45,3
3,Delta,44,90,74,87,87,85,98,4
4,Echo,55,91,78,67,41,82,75,5
5,Foxtrot,66,72,90,90,45,81,71,6
6,Golf,77,76,76,65,96,74,70,7
7,Hotel,88,89,78,67,56,75,60,8
8,India,99,67,90,56,93,96,90,9
9,Juliet,111,85,54,90,78,90,93,10

In [60]:
df['added']=df['Id']+df['Extra']
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added
0,Alpha,11,78,89,45,81,96,67,1,12
1,Bravo,22,67,87,67,85,95,48,2,24
2,Charlie,33,89,67,89,89,84,45,3,36
3,Delta,44,90,74,87,87,85,98,4,48
4,Echo,55,91,78,67,41,82,75,5,60
5,Foxtrot,66,72,90,90,45,81,71,6,72
6,Golf,77,76,76,65,96,74,70,7,84
7,Hotel,88,89,78,67,56,75,60,8,96
8,India,99,67,90,56,93,96,90,9,108
9,Juliet,111,85,54,90,78,90,93,10,121

In [61]:
df['Extra2'] = range(20,30)
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added,Extra2
0,Alpha,11,78,89,45,81,96,67,1,12,20
1,Bravo,22,67,87,67,85,95,48,2,24,21
2,Charlie,33,89,67,89,89,84,45,3,36,22
3,Delta,44,90,74,87,87,85,98,4,48,23
4,Echo,55,91,78,67,41,82,75,5,60,24
5,Foxtrot,66,72,90,90,45,81,71,6,72,25
6,Golf,77,76,76,65,96,74,70,7,84,26
7,Hotel,88,89,78,67,56,75,60,8,96,27
8,India,99,67,90,56,93,96,90,9,108,28
9,Juliet,111,85,54,90,78,90,93,10,121,29

In [62]:
df['Extra3'] = np.arange(40,50)
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added,Extra2,Extra3
0,Alpha,11,78,89,45,81,96,67,1,12,20,40
1,Bravo,22,67,87,67,85,95,48,2,24,21,41
2,Charlie,33,89,67,89,89,84,45,3,36,22,42
3,Delta,44,90,74,87,87,85,98,4,48,23,43
4,Echo,55,91,78,67,41,82,75,5,60,24,44
5,Foxtrot,66,72,90,90,45,81,71,6,72,25,45
6,Golf,77,76,76,65,96,74,70,7,84,26,46
7,Hotel,88,89,78,67,56,75,60,8,96,27,47
8,India,99,67,90,56,93,96,90,9,108,28,48
9,Juliet,111,85,54,90,78,90,93,10,121,29,49

In [63]:
df['Extra'] = [a for a in range(50) if a%5==0]
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added,Extra2,Extra3
0,Alpha,11,78,89,45,81,96,67,0,12,20,40
1,Bravo,22,67,87,67,85,95,48,5,24,21,41
2,Charlie,33,89,67,89,89,84,45,10,36,22,42
3,Delta,44,90,74,87,87,85,98,15,48,23,43
4,Echo,55,91,78,67,41,82,75,20,60,24,44
5,Foxtrot,66,72,90,90,45,81,71,25,72,25,45
6,Golf,77,76,76,65,96,74,70,30,84,26,46
7,Hotel,88,89,78,67,56,75,60,35,96,27,47
8,India,99,67,90,56,93,96,90,40,108,28,48
9,Juliet,111,85,54,90,78,90,93,45,121,29,49

In [64]:
df['Total'] = 600
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,added,Extra2,Extra3,Total
0,Alpha,11,78,89,45,81,96,67,0,12,20,40,600
1,Bravo,22,67,87,67,85,95,48,5,24,21,41,600
2,Charlie,33,89,67,89,89,84,45,10,36,22,42,600
3,Delta,44,90,74,87,87,85,98,15,48,23,43,600
4,Echo,55,91,78,67,41,82,75,20,60,24,44,600
5,Foxtrot,66,72,90,90,45,81,71,25,72,25,45,600
6,Golf,77,76,76,65,96,74,70,30,84,26,46,600
7,Hotel,88,89,78,67,56,75,60,35,96,27,47,600
8,India,99,67,90,56,93,96,90,40,108,28,48,600
9,Juliet,111,85,54,90,78,90,93,45,121,29,49,600

In [68]:
# Deleting a column or columns 
# using del 


del df['Extra3']
del df['added']

# permanent deletes a column
df

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Extra,Total
0,Alpha,11,78,89,45,81,96,67,0,600
1,Bravo,22,67,87,67,85,95,48,5,600
2,Charlie,33,89,67,89,89,84,45,10,600
3,Delta,44,90,74,87,87,85,98,15,600
4,Echo,55,91,78,67,41,82,75,20,600
5,Foxtrot,66,72,90,90,45,81,71,25,600
6,Golf,77,76,76,65,96,74,70,30,600
7,Hotel,88,89,78,67,56,75,60,35,600
8,India,99,67,90,56,93,96,90,40,600
9,Juliet,111,85,54,90,78,90,93,45,600

In [69]:
df.drop('Extra',axis=1)

,Name,Id,Python,Excel,Power_bi,Pandas,Machine_learning,Stats,Total
0,Alpha,11,78,89,45,81,96,67,600
1,Bravo,22,67,87,67,85,95,48,600
2,Charlie,33,89,67,89,89,84,45,600
3,Delta,44,90,74,87,87,85,98,600
4,Echo,55,91,78,67,41,82,75,600
5,Foxtrot,66,72,90,90,45,81,71,600
6,Golf,77,76,76,65,96,74,70,600
7,Hotel,88,89,78,67,56,75,60,600
8,India,99,67,90,56,93,96,90,600
9,Juliet,111,85,54,90,78,90,93,600